#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repos.github_repository_collaborator.brendon_admin[0]: Refreshing state... [id=jk-testing:BrendonLH]
module.github_repos.github_repository_collaborator.brendon_admin[1]: Refreshing state... [id=tf-created-repo:BrendonLH]
module.github_repos.github_repository_collaborator.jin_admin[0]: Refreshing state... [id=jk-testing:jinwoov]
module.github_repos.github_repository.repo_creation[1]: Refreshing state... [id=tf-created-repo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github_repos.github_repository.repo_creation[0] will be created
  + resource "github_repository" "repo_creation" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Created using Terraform automation"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tf-created-repo"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # module.github_repos.github_repository.repo_creation[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "github_repository" "repo_creation" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Created using Terraform automation" -> null
      - etag                        = "W/\"684f0ce733c8e3b0412a270b52dfbef89a538d01c0b04955fa93d5ab2f0594e3\"" -> null
      - full_name                   = "teamjab/tf-created-repo" -> null
      - git_clone_url               = "git://github.com/teamjab/tf-created-repo.git" -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/teamjab/tf-created-repo" -> null
      - http_clone_url              = "https://github.com/teamjab/tf-created-repo.git" -> null
      - id                          = "tf-created-repo" -> null
      - is_template                 = false -> null
      - license_template            = "mit" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "tf-created-repo" -> null
      - node_id                     = "R_kgDOIYl36A" -> null
      - private                     = false -> null
      - repo_id                     = 562657256 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:teamjab/tf-created-repo.git" -> null
      - svn_url                     = "https://github.com/teamjab/tf-created-repo" -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.github_repos.github_repository_collaborator.brendon_admin[0] must be replaced
-/+ resource "github_repository_collaborator" "brendon_admin" {
      ~ id                          = "jk-testing:BrendonLH" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ repository                  = "jk-testing" -> "tf-created-repo" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.github_repos.github_repository_collaborator.brendon_admin[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "github_repository_collaborator" "brendon_admin" {
      - id                          = "tf-created-repo:BrendonLH" -> null
      - permission                  = "admin" -> null
      - permission_diff_suppression = false -> null
      - repository                  = "tf-created-repo" -> null
      - username                    = "BrendonLH" -> null
    }

  # module.github_repos.github_repository_collaborator.jin_admin[0] must be replaced
-/+ resource "github_repository_collaborator" "jin_admin" {
      ~ id                          = "jk-testing:jinwoov" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ repository                  = "jk-testing" -> "tf-created-repo" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jinwoov, Action: `pull_request`, Working Directory: ``, Workflow: `tf_deploy`*